#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_iam_user.publisher: Refreshing state... [id=ecr-publisher]
aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:eu-west-1:019359575870:cluster/EADesign-Cluster]
aws_ecr_repository.repository: Refreshing state... [id=app-registry]
aws_iam_role.fargate: Refreshing state... [id=fargate-role]
aws_iam_user_policy.publisher: Refreshing state... [id=ecr-publisher:ecr-publisher]
aws_iam_access_key.publisher: Refreshing state... [id=AKIAQJAPLV47IIHFPX7V]
aws_iam_role_policy.fargate: Refreshing state... [id=fargate-role:fargate-execution-role]
aws_ecs_task_definition.task: Refreshing state... [id=service]
aws_ecr_repository_policy.policy: Refreshing state... [id=app-registry]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:019359575870:loadbalancer/app/eadesign-alb/0e79135d95451cda]
aws_lb_target_group.group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:019359575870:targetgroup/ead-alb-tg/3a82d095726cfbfa]
aws_lb_listener.front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:019359575870:listener/app/eadesign-alb/0e79135d95451cda/b6e88c2c5d2386e6]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:eu-west-1:019359575870:service/EADesign-Cluster/EADesign-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lb.alb will be updated in-place
  ~ resource "aws_lb" "alb" {
        id                         = "arn:aws:elasticloadbalancing:eu-west-1:019359575870:loadbalancer/app/eadesign-alb/0e79135d95451cda"
        name                       = "eadesign-alb"
      ~ security_groups            = [
          - "sg-8318fcd4",
        ] -> (known after apply)
        tags                       = {}
        # (13 unchanged attributes hidden)


        # (4 unchanged blocks hidden)
    }

  # aws_security_group.allow_http will be created
  + resource "aws_security_group" "allow_http" {
      + arn                    = (known after apply)
      + description            = "Allow HTTP inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP from Anywhere"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "allow_http"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "allow_http"
        }
      + vpc_id                 = "vpc-9e922fe7"
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @morganmcel, Action: `pull_request`*